v2112/run/phobic2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001; // meter to mm

hY 30; // channel height

bY 20; // nr of blocks on y direction


vertices
(
	(0		0		-0.1)	// v0
	(7.5	0		-0.1)	// v1
	(7.5	$hY		-0.1)	// v2
	(0		$hY		-0.1)	// v3
	(0		0		0.1)	// v4
	(7.5	0		0.1)	// v5
	(7.5	$hY		0.1)	// v6
	(0		$hY		0.1)	// v7

	(17.5	0		-0.1)	// v8
	(82.5	0		-0.1)	// v9
	(82.5	$hY		-0.1)	// v10
	(17.5	$hY		-0.1)	// v11
	(17.5	0		0.1)	// v12
	(82.5	0		0.1)	// v13
	(82.5	$hY		0.1)	// v14
	(17.5	$hY		0.1)	// v15

	(92.5	0		-0.1)	// v16
	(100	0		-0.1)	// v17
	(100	$hY		-0.1)	// v18
	(92.5	$hY		-0.1)	// v19
	(92.5	0		0.1)	// v20
	(100	0		0.1)	// v21
	(100	$hY		0.1)	// v22
	(92.5	$hY		0.1)	// v23

	(7.5	100		-0.1)	// v24
	(17.5	100		-0.1)	// v25
	(82.5	100		-0.1)	// v26
	(92.5	100		-0.1)	// v27
	(92.5	100		0.1)	// v28
	(82.5	100		0.1)	// v29
	(17.5	100		0.1)	// v30
	(7.5	100		0.1)	// v31
);

blocks
(
	hex (0 1 2 3 4 5 6 7)
	(15 20 1)
	simpleGrading (1 1 1)

	hex (1 8 11 2 5 15 14 6)
	(20 20 1)
	simpleGrading (1 1 1)

	hex (8 9 10 11 12 13 14 15)
	(130 20 1)
	simpleGrading (1 1 1)

	hex (9 16 19 10 13 20 23 14)
	(20 20 1)
	simpleGrading (1 1 1)

	hex (16 17 18 19 20 21 22 23)
	(15 20 1)
	simpleGrading (1 1 1)

	hex (2 11 25 24 6 15 30 31)
	(20 20 1)
	simpleGrading (1 1 1)

	hex (10 19 27 26 14 23 28 29)
	(20 20 1)
	simpleGrading (1 1 1)

);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(24 25 30 31)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(26 27 28 29)
		);
	}
	normalWall
	{
		type wall;
		faces
		(
			(0 3 7 4)
			(2 24 31 6)
			(25 11 15 30)
			(10 26 29 14)
			(27 19 23 28)
			(18 17 21 22)
		);
	}
	targetWall
	{
		type wall;
		faces
		(
			(3 2 6 7)
			(19 18 22 23)

			(11 10 14 15)
			(1 0 4 5)
			(8 1 5 12)
			(9 8 12 13)
			(16 9 13 20)
			(17 16 20 21)
		);
	}
	frontAndBack
	{
		type empty;
		faces
		(
			(0 1 2 3)
			(1 8 11 2)
			(8 9 10 11)
			(9 16 19 10)
			(16 17 18 19)
			(4 7 6 5)
			(5 6 15 12)
			(12 15 14 13)
			(13 14 23 20)
			(20 23 22 21)

			(2 11 25 24)
			(10 19 27 26)
			(6 31 30 15)
			(14 29 28 23)
		);
	}
);

// ************************************************************************* //
